backend/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."name" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def show
    category = Category.find_by(name: params[:name])

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "cookers"], ["description", nil], ["created_at", "2023-04-21 06:22:26.899913"], ["updated_at", "2023-04-21 06:22:26.899913"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."name" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def set_category
      @category = Category.find_by(name: params[:name])