backend/app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    if @order.save
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at", "billing_information", "address") VALUES (?, ?, ?, ?, ?)  [["user_id", 6], ["created_at", "2023-04-21 07:10:09.799521"], ["updated_at", "2023-04-21 07:10:09.799521"], ["billing_information", nil], ["address", nil]]