backend/app/controllers/order_items_controller.rb

  def index
    @order_items = OrderItem.all
---
SELECT "order_items".* FROM "order_items"