backend/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "category_id", "price", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    if @product.save

UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Canon EOS R67"], ["updated_at", "2023-04-19 20:48:51.520706"], ["id", 1]]
---
  def update
    if @product.update(product_params)