backend/app/controllers/users_controller.rb

  def create
    allowed_roles = ['admin', 'user']
    role = user_params[:role]
    if role.present? && !allowed_roles.include?(role)
      render json: { errors: ['Invalid role specified'] }, status: :unprocessable_entity
      return
    end

    begin
      user = User.new(user_params)
      user.role = role if role.present?
      user.password = params[:password]
      user.password_confirmation = params[:password_confirmation]
      user.save!
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?)