backend/app/controllers/users_controller.rb

  def create
    allowed_roles = ['admin', 'user']
    valid_role = user_params[:role]
    if valid_role.present? && !allowed_roles.include?(valid_role)
      render json: { errors: ['Invalid role specified'] }, status: :unprocessable_entity
      return
    end

    begin
      user = User.new(user_params)
      role = user_params[:role]
      if role.present? && allowed_roles.include?(role)
        if user_params[:role] == 'admin'
          user.role = true
        elsif user_params[:role] == 'user'
          user.role = false
        end
      end
      user.password = params[:password]
      user.password_confirmation = params[:password_confirmation]
      user.save!
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?)